
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/14988194759)


<pre><code>Plan: 0 to add, 17 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_zero_trust_access_application.applications[&#34;alloy-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;cadvisor-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;esphome-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;gate-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;grafana-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;hass-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;kodi-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;msr-2-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;prometheus-rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;rpi-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;transmission-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;uzg-01-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;zigbee2mqtt-rpi-2&#34;]
  * cloudflare_zero_trust_access_identity_provider.google_oauth
  * cloudflare_zero_trust_access_policy.allow_all
  * cloudflare_zero_trust_access_policy.google_sso_access
  * cloudflare_zero_trust_access_policy.uptimerobot_direct_access


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_zero_trust_access_application.applications["alloy-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "3c7329ebcdf76ac25346176736da3cf4b47c8146f3a6e9a7c3d2fb0990669723" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "alloy-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "795489f0-2d6a-4d95-9a59-3d13f56210e9"
      + landing_page_design          = (known after apply)
        name                         = "alloy-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "alloy-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "36e1a385b530adb20fad2fb76da0ab88f36830ccc6d25df6ab53f262755178f9" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "cadvisor-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "6432d16c-e2d4-45c2-8a06-889bf826d29a"
      + landing_page_design          = (known after apply)
        name                         = "cadvisor-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "cadvisor-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "2a1aa122ae110462f483b53c3457619907218143710e47c289ba4f8c716acf19" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "esphome-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "b145d8d8-6b02-44ff-82e0-588725c3b142"
      + landing_page_design          = (known after apply)
        name                         = "esphome-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "esphome-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
          - "iot",
            "container",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "a514df2c82e2a8d23f95e8c2b81f73682f88fce614997eb148cc97390f4a8c9d" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "3bca7c79-e640-4b9f-b308-25186c516d85"
      + landing_page_design          = (known after apply)
        name                         = "gate-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "lan",
            "router",
            "wan",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "64d1530b46934d325733fcb2757a0a89564ba400f8bbd81b3000b865c724fd49" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "grafana-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "a003323e-7768-47cb-a9e1-d26b63c43d4f"
      + landing_page_design          = (known after apply)
        name                         = "grafana-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "grafana-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "12eb9df43c4de5201c143df17e62e9c4ad8e8dcedd95675b857162a9fbf036a1" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "hass-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "f7e66c54-502b-41f4-9933-a320da13ec85"
      + landing_page_design          = (known after apply)
        name                         = "hass-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0"
              - include    = [
                  - {
                      - everyone = {} -> null
                    },
                ] -> null
              - name       = "Allow All - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "hass-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
          - "iot",
            "container",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "fae59c26739e2f9ad62a5a074c54a888e1c8a7ee5867e5de54834533558fb701" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "kodi-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "fa412984-a630-46ca-908b-f9450d4e052f"
      + landing_page_design          = (known after apply)
        name                         = "kodi-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "kodi-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["msr-2-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "bed7c7bf9d9c159f4ae8c31c72f9d181110c5d8425cc9707b90a4c16c8e121f9" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "ce836061-746b-40dc-b891-65147da8f9ee"
      + landing_page_design          = (known after apply)
        name                         = "msr-2-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "iot",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "dc45651b3e4f4261cabf962a7d0bc2e222ae4bc490281963e319db334d41ddb8" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "prometheus-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "ea171e86-d39c-4c5d-9ce0-a06566356efd"
      + landing_page_design          = (known after apply)
        name                         = "prometheus-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "prometheus-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "b5c8aa70a095f041c859a9c053e977458959bfec94ea10349300b9bdc36c3b42" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:08:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "55015532-ac7f-4e27-8384-a9e07e7337a9"
      + landing_page_design          = (known after apply)
        name                         = "rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "container",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:18Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["transmission-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "55c22e1d5c20ba855c4f7f5f4affb431adf66295a10edb133ccfd1759b5e32f9" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "transmission-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "ac456fd1-facb-4edc-8939-e7dddbc66597"
      + landing_page_design          = (known after apply)
        name                         = "transmission-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "transmission-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "router",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["uzg-01-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "ec1c48dc9efc04e4a7edd403090dd8b6b7ace07dcfbafe6dee610bdcdb25dfcc" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "e488f83b-a5ef-4ada-b983-2f30678e27e5"
      + landing_page_design          = (known after apply)
        name                         = "uzg-01-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "lan",
            "iot",
          + "lan",
        ]
      ~ updated_at                   = "2025-05-13T04:28:18Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "504a0a97f70ff66ba4d9d6e6de099a4085241044cd6bc5e340d6749f9d0ee753" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "zigbee2mqtt-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "dd152de5-0de8-431b-bc13-d7dcbf050d09"
      + landing_page_design          = (known after apply)
        name                         = "zigbee2mqtt-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "zigbee2mqtt-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
          - "iot",
            "container",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:28:15Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "1a36ca86-d5c6-4e00-b003-006e2034fff3"
        name        = "My Test Google IDP - 2"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.allow_all will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "allow_all" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-12T05:27:46Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0"
        name             = "Allow All - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T04:28:14Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2c8404fb-81ca-4bab-835f-b933c0649e90"
        name             = "Google SSO Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T04:28:14Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
        name             = "UptimeRobot Direct Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T04:28:14Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":190,"Program":"tfcmt","SHA1":"fc3e836458b108e85dfe78f0209efdc551b52868","Vars":{},"WorkflowName":"tofu-cloudflare"} -->